app/views/admins/show_books.html.erb

SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <td><%= book.subject %></td>
        <td><%=  Library.find(book.library_id ).name %></td>