app/views/librarians/registrations/new.html.erb

    <%= form.label :library %>
    <%= select("librarian", "library", Library.all.collect{ |c| [ c.name] }) %>
---
SELECT "libraries".* FROM "libraries"