app/views/books/books_students.html.erb

        <td><%= book.category %></td>
        <td><%=  Library.find(book.library_id ).name %></td>
---
SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]