app/views/books/getBookmarkBooks.html.erb

SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---

        <td><%= Library.find(book.library_id).name %></td>

SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <td><%= book.category %></td>
      <td><%= Library.find(book.library_id).name %></td>