app/views/books/list_checkedoutBooks.html.erb

        <td><%= book.special_collection %></td>
        <td><%= Library.find(book.library_id).name %></td>
---
SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]