app/views/books/show.html.erb

SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <strong>Library:</strong>
  <%= Library.find(@book.library_id ).name %>