app/controllers/librarians_controller.rb

  def index
    if admin_signed_in?
      sign_out :librarian
      redirect_to admins_path
	  elsif student_signed_in?
      sign_out :librarian
      redirect_to students_path, notice: 'Action not allowed.'
    else
      @lib = Librarian.find_by!(:email => @librarian[:email])
      current_librarian = @librarian
      if @lib.approved == 'No'
        redirect_to restricted_path
      else
        library_name = @lib[:library]
        @library = Library.all.where(:name => library_name).first
---
SELECT "librarians".* FROM "librarians" WHERE "librarians"."email" = ? LIMIT ?  [["email", "ha@gmail.com"], ["LIMIT", 1]]
SELECT "libraries".* FROM "libraries" WHERE "libraries"."name" = ? ORDER BY "libraries"."id" ASC LIMIT ?  [["name", "Tạ Quang Bửu"], ["LIMIT", 1]]

  def update
	  if student_signed_in?
      sign_out :librarian
      redirect_to students_path, notice: 'Action not allowed.'
    end
		respond_to do |format|
		  if @librarian.update(librarian_params)
---
UPDATE "librarians" SET "approved" = ?, "updated_at" = ?, "encrypted_password" = ? WHERE "librarians"."id" = ?  [["approved", "Yes"], ["updated_at", "2023-02-10 13:17:25.031789"], ["encrypted_password", "[FILTERED]"], ["id", 1]]

  def destroy
	if student_signed_in?
      sign_out :librarian
      redirect_to students_path, notice: 'Action not allowed.'
    else
		@librarian.destroy
---
DELETE FROM "librarians" WHERE "librarians"."id" = ?  [["id", 12]]

    def set_librarian
      if (!current_librarian.nil?)
        @librarian = Librarian.find(current_librarian[:id])
      else
        @librarian = Librarian.find(params[:id])
---
SELECT "librarians".* FROM "librarians" WHERE "librarians"."id" = ? ORDER BY "librarians"."id" ASC LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT "librarians".* FROM "librarians" WHERE "librarians"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]