app/controllers/students_controller.rb

  def update
  if librarian_signed_in?
      sign_out :student
      redirect_to librarians_path , notice: 'Action not allowed.'
    else
		respond_to do |format|
		  if @student.update(student_params)
---
UPDATE "students" SET "education_level" = ?, "updated_at" = ?, "encrypted_password" = ? WHERE "students"."id" = ?  [["education_level", "B.S."], ["updated_at", "2023-02-09 18:57:46.362010"], ["encrypted_password", "[FILTERED]"], ["id", 5]]

    def set_student
      @student = Student.find(params[:id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]