app/views/librarians/_form.html.erb

    <%= form.label :library %>
    <%= select("librarian", "library", Library.all.collect{ |c| [ c.name] }) %>
---
SELECT "libraries".* FROM "libraries"